---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LegendFailures.LegendComponentNotVisible
source: html/c1b4671e-a357-f584-eb6f-7c307525b1e0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LegendFailures.LegendComponentNotVisible Property

The component you have selected is not visible in the selected view.

## Syntax (C#)
```csharp
public static FailureDefinitionId LegendComponentNotVisible { get; }
```